import string
import random

print("\t\tВП3_ЛР3 Вариант 4")
print("\tЗадание 1:")
# В строке заменить букву(а) буквой (о)
str1 = input("Введите строку:\t\t ")
print("Символов в строке -", len(str1))
print("Количество замен - ", str1.count('а'))
str1 = str1.replace('а','о')
print("Изменненная строка:\t", str1)

print("\tЗадание 2:")
# Вычислить сумму элементов с нечетными индексами
print("Введите количество элементов массива")
n=int(input())
sum = 0
mas=[0 for i in range(n)]
for i in range(n):
    mas[i]=random.randint(3,42)
    print (mas[i], end="  ")
    if i%2==1:
        sum+=mas[i]
print ("\nСумма числел с нечетными индексами", sum)

print("\tЗадание 3:")
# Заменить элементы массива меньшие 15 их удвоенными значениями
mas2=[random.randint(3,42) for i in range(8)]
print("Исходный массив  ",mas2)
for i in range(8):
    if mas2[i]<15:
        mas2[i]*=2
print("Измененный массив",mas2)

print("\tЗадание 4:")
# Выделить общие и различные элементы в списках
ls4 = ["ДМ", "МЗЯП", "ОЭ", "ВП", "Физика", "Физ-ра", "Философия", "ИНО"]
ls8 = ["ПМ", "ОТВ и МС", "ТИ", "ИТН", "Физика", "Физ-ра", "Философия", "ИНО", "МХ"]
ls2 = ["ДМ", "МЗЯП", "ВычМат", "ЭМ", "ЭлТех", "Физика", "Физ-ра", "Философия", "ИНО"]
print("Общие для всех специальностей", set(ls4)&set(ls8)&set(ls2))
print("Уникальные в ИУК4", set(ls4)-set(ls8)-set(ls2))
print("Уникальные в МК8", set(ls8)-set(ls4)-set(ls2))
print("Уникальные в ИУК2", set(ls2)-set(ls8)-set(ls4))